In [35]:
import pandas as pd
import numpy as np
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [36]:
df_data_original =pd.read_csv("DATA.CSV",index_col=0)
df_data_original.head(2).T

                                            0              1
Age                                        51             52
Attrition                                  No             No
BusinessTravel                            NaN            NaN
DailyRate                              684,0$         699,0$
Department                                NaN            NaN
DistanceFromHome                            6              1
Education                                   3              4
EducationField                            NaN  Life Sciences
employeecount                               1              1
employeenumber                          162,0          259,0
EnvironmentSatisfaction                     1              3
Gender                                      0              0
HourlyRate                                 51             65
JobInvolvement                              3              2
JobLevel                                    5              5
JobRole                    resEArch DIREcToR        ManAGeR
JobSatisfaction                             3              3
MaritalStatus                             NaN            NaN
MonthlyIncome                         19537,0        19999,0
MonthlyRate                              6462           5678
NUMCOMPANIESWORKED                          7              0
Over18                                      Y            NaN
OverTime                                   No            NaN
PercentSalaryHike                          13             14
PerformanceRating                         3,0            3,0
RelationshipSatisfaction                    3              1
StandardHours                             NaN            NaN
StockOptionLevel                            0              1
TOTALWORKINGYEARS                         NaN           34,0
TrainingTimesLastYear                       5              5
WORKLIFEBALANCE                           3,0            3,0
YearsAtCompany                             20             33
YearsInCurrentRole                        NaN            NaN
YearsSinceLastPromotion                    15             11
YEARSWITHCURRMANAGER                       15              9
SameAsMonthlyIncome                   19537,0        19999,0
DateBirth                                1972           1971
Salary                            1000000000$    1000000000$
RoleDepartament                           NaN            NaN
NUMBERCHILDREN                            NaN            NaN
RemoteWork                                Yes              1

In [37]:
df_data_original.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'employeecount',
       'employeenumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NUMCOMPANIESWORKED',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TOTALWORKINGYEARS', 'TrainingTimesLastYear', 'WORKLIFEBALANCE',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YEARSWITHCURRMANAGER', 'SameAsMonthlyIncome', 'DateBirth', 'Salary',
       'RoleDepartament', 'NUMBERCHILDREN', 'RemoteWork'],
      dtype='object')

##### Homogeneización del nombre de las columnas (en minúsculas)

In [38]:
df_data_copy= df_data_original.copy()

In [39]:
df_data_copy.head(2)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1

In [40]:
nuevas_columnas={columna:columna.lower() for columna in df_data_copy} #modificamos las columnas a minúsculas
df_data_copy.rename(columns= nuevas_columnas, inplace= True) #cambiamos las columnas antiguas por las homogeneizadas en el paso anterior (nuevas_columnas)

In [41]:
df_data_copy.head(2).T

                                            0              1
age                                        51             52
attrition                                  No             No
businesstravel                            NaN            NaN
dailyrate                              684,0$         699,0$
department                                NaN            NaN
distancefromhome                            6              1
education                                   3              4
educationfield                            NaN  Life Sciences
employeecount                               1              1
employeenumber                          162,0          259,0
environmentsatisfaction                     1              3
gender                                      0              0
hourlyrate                                 51             65
jobinvolvement                              3              2
joblevel                                    5              5
jobrole                    resEArch DIREcToR        ManAGeR
jobsatisfaction                             3              3
maritalstatus                             NaN            NaN
monthlyincome                         19537,0        19999,0
monthlyrate                              6462           5678
numcompaniesworked                          7              0
over18                                      Y            NaN
overtime                                   No            NaN
percentsalaryhike                          13             14
performancerating                         3,0            3,0
relationshipsatisfaction                    3              1
standardhours                             NaN            NaN
stockoptionlevel                            0              1
totalworkingyears                         NaN           34,0
trainingtimeslastyear                       5              5
worklifebalance                           3,0            3,0
yearsatcompany                             20             33
yearsincurrentrole                        NaN            NaN
yearssincelastpromotion                    15             11
yearswithcurrmanager                       15              9
sameasmonthlyincome                   19537,0        19999,0
datebirth                                1972           1971
salary                            1000000000$    1000000000$
roledepartament                           NaN            NaN
numberchildren                            NaN            NaN
remotework                                Yes              1

# 2. Limpieza y verificación de datos
- 2.1 Modificar columnas categóricas a numéricas
- 2.2 Homogeneizar las etiquetas de las columnas categóricas
- 2.3 Distance from home - cambiar los valores negativos a positivos -- Nuestra decisión es que hubo un error de inserción pero q son valores positivos
- 2.4 Creación de nuevas columnas

#### 2.1 Cambiar de strings (objeto) a numéricas

In [42]:
#____STRING A INT_________
#age:               12 valores en letras: cambiarlos a nros + convertir todos los nros a int.
#worklifebalance quitar ",0" y convertir a int.

#____STRING A FLOAT_________
#totalworkingyears: cambiar comas por puntos
#daily rate (comas por puntos y quitarle el símbolo del dolar)
#hourly rate
#monthlyincome
#monthlyrate

In [43]:
#Age:
def texto_nro(cadena):
    cadena = cadena.replace("twenty-six","26").replace("twenty-four","24").replace("thirty-two","32").replace("thirty-six","36").replace("thirty-seven","37").replace("thirty-one","31").replace("thirty","30").replace("forty-seven","47").replace("fifty-two","52").replace("fifty-five","55").replace("fifty-eight","58")
    return int(cadena)

df_data_copy["age"] = df_data_copy["age"].apply(texto_nro)

In [44]:
#Worklifebalance:  ### AUNQUE LO DIGA QUE A UN INT. LO CONVIERTE A FLOAT

def nro(cadena):

    try: 
        cadena = cadena.replace(",0","")
        return int(cadena)
    
    except: 
        return np.nan #tiene varios valores que son "nan"

df_data_copy["worklifebalance"] = df_data_copy["worklifebalance"].apply(nro)

In [45]:
# totalworkingyears", "monthlyincome", "monthlyrate: Cambio de string a float

def decimal(cadena):

    try: 
        return float(cadena.replace(",",".").replace("$","."))

    except: 
        return np.nan #tiene varios valores que son "nan"
    
columnas_decimal = ["totalworkingyears", "monthlyincome"]

for columna in columnas_decimal:
    df_data_copy[columna] = df_data_copy[columna].apply(decimal)

In [46]:
# "hourlyrate", "monthlyrate" : cambio de string a float - no tienen decimales

def decimal3(cadena):
    try:
        return float(cadena)
    except:
        return np.nan

col_dec_ent = ["hourlyrate", "monthlyrate"]

for columna in col_dec_ent:
    df_data_copy[columna] = df_data_copy[columna].apply(decimal3)

In [47]:
## Nota: hourlyrate - parecía en el original como si no hubiese nulos pero había algunos que eran "Not available" y q contaban como interger

#### 2.2 Homogeneizar categóricas

In [48]:
#Columnas a homogeneizar sus categorías:
# educationfield (minúsculas)
# jobrole (minúsculas)
# maritalstatus(minúsculas y homogeneización)

def homogeneizar(cadena):
    try:
        return cadena.lower().replace("marreid","married")
    except:
        return np.nan

col_homo = ["educationfield", "jobrole", "maritalstatus"]

for columna in col_homo:
    df_data_copy[columna] = df_data_copy[columna].apply(homogeneizar)

In [50]:
#df_data_copy[["educationfield", "jobrole", "maritalstatus"]]

In [51]:
#df_data_copy["educationfield"].value_counts()

In [120]:
# Homogeneizar "remotework" a 2 opciones: Yes, No
df_data_copy["remotework"] = df_data_copy["remotework"].replace({"True": "Yes", 'False': "No", '0': "No", '1': "Yes"})

#### 2.3 Distance from home - cambiar negativos a positivos

In [59]:
def cambiar_positivos(numero):
    try:
        return abs(numero) #"abs" es un método de pandas para cambiar de negativo a positivo
    except:
        return np.nan

df_data_copy["distancefromhome"] = df_data_copy["distancefromhome"].apply(cambiar_positivos)

In [ ]:
#OPCIÓN 2_alternativa
# df_data_copy["distancefromhome"] = df_data_copy["distancefromhome"].apply(lambda x: int(str(x).replace("-", "")) if "-" in str(x) else int(x))
# df_data_copy

#### 2.4 Creación de nuevas columnas

In [53]:
#1. GÉNERO

#Creamos la función 
def categorizar_gender (numero):
    if numero == 0:
        return 'male'
    else:
        return 'female'

#Creación de una columna con la función
df_data_copy["gender_cat"] = df_data_copy["gender"].apply(categorizar_gender)

filas duplicadas

In [52]:
filas_duplicadas = df_data_copy[df_data_copy.duplicated()]
cantidad_filas_duplicadas = len(filas_duplicadas)
cantidad_filas_duplicadas
df_sin_duplicados = df_data_copy.drop_duplicates()
df_sin_duplicados
df_sin_duplicados = df_data_copy.drop_duplicates()
print("Cantidad de filas antes de eliminar duplicados:“, len(df_data))
print("Cantidad de filas después de eliminar duplicados:“, len(df_sin_duplicados))
filas_eliminadas = len(df_data) - len(df_sin_duplicados)
print(“Cantidad de filas eliminadas por duplicados:“, filas_eliminadas)

SyntaxError: EOL while scanning string literal (2132504206.py, line 7)

In [ ]:
df_data_copy.duplicated().sum()  #Nro. de duplicados

17

## Nuestras decisiones
Distance from home - cambiar los valores negativos a positivos -- Nuestra decisión es que hubo un error de inserción pero q son valores positivos